function tx = generateLFM(para)
%% ==========================================================
% 文件名：generateLFM.m
% 功能：产生连续线性调频LFM信号
% MATLAB R2024b
% ==========================================================

%% 时间轴
t = para.t;

%% ==========================================================
% 连续LFM信号
%
% s(t) = exp(j*2*pi*(f0*t + 0.5*K*t^2))
% ==========================================================

phase = 2*pi * ...
       (para.fStart .* t + ...
        0.5 * para.K .* t.^2);

tx = exp(1j * phase);

%% 幅度归一化
tx = tx ./ max(abs(tx));

end